-DATASET CSV tinysnb

--

-CASE FunctionLabel

-STATEMENT MATCH (a) RETURN DISTINCT label(a);
---- 3
movies
organisation
person
-STATEMENT MATCH (a) RETURN DISTINCT labels(a);
---- 3
movies
organisation
person
-STATEMENT MATCH (a)-[e]->(b) RETURN DISTINCT label(e);
---- 5
knows
marries
meets
studyAt
workAt
-STATEMENT MATCH (a)-[e]->(b) RETURN DISTINCT labels(e);
---- 5
knows
marries
meets
studyAt
workAt
-STATEMENT MATCH (a:person) RETURN labels(null);
---- 8








-STATEMENT RETURN labels(null);
---- 1

-LOG LabelOnPathNodeExtract
-STATEMENT MATCH p = (n)-[:knows]->(m:person {ID: 2}) WITH nodes(p) AS ns RETURN label(ns[1]);
---- 3
person
person
person
